[
  {
    "gid": "2",
    "cypher": "MATCH (x)-[relation]-(entity) WHERE entity.lemma =~ \"{0}\" RETURN *",
    "input": [
      {
        "id": "n",
        "type": "entity"
      }
    ],
    "output": [
      "x",
      "relation",
      "entity"
    ],
    "texts": {
      "english": "Show some details about {0}."
    },
    "groups": {
      "english": "Detail"
    }
  },
  {
    "gid": "2",
    "cypher": "MATCH (x)-[relation*1..2]-(entity) WHERE entity.lemma =~ \"{0}\" RETURN *",
    "input": [
      {
        "id": "n",
        "type": "entity"
      }
    ],
    "output": [
      "x",
      "relation",
      "entity"
    ],
    "texts": {
      "english": "Show some more details about {0}."
    },
    "groups": {
      "english": "Detail"
    }
  },
  {
    "gid": "3",
    "cypher": "MATCH (entity) WHERE entity.lemma =~ \"{0}\" RETURN labels(entity) as entity_labels",
    "input": [
      {
        "id": "n",
        "type": "entity"
      }
    ],
    "output": [
      "entity_labels"
    ],
    "texts": {
      "english": "What is the type of {0}?"
    },
    "groups": {
      "english": "Type"
    }
  },
  {
    "gid": "3",
    "cypher": "MATCH (entity:{0}) RETURN entity, labels(entity) as entity_labels",
    "input": [
      {
        "id": "t",
        "type": "entity_type"
      }
    ],
    "output": [
      "entity",
      "entity_labels"
    ],
    "texts": {
      "english": "Find all the entities of type {0}."
    },
    "groups": {
      "english": "Type"
    }
  },
  {
    "gid": "3",
    "cypher": "MATCH (n1)-[r:{0}]->(n2) RETURN *",
    "input": [
      {
        "id": "r",
        "type": "relation"
      }
    ],
    "output": [
      "n1",
      "r",
      "n2"
    ],
    "texts": {
      "english": "Find all the entities related by the relation {0}."
    },
    "groups": {
      "english": "Type"
    }
  },
  {
    "gid": "10",
    "cypher": "MATCH (x)-[relation:{0}]->(node) WHERE node.lemma =~ \"{1}\" RETURN *",
    "input": [
      {
        "id": "r",
        "type": "relation"
      },
      {
        "id": "n",
        "type": "entity"
      }
    ],
    "output": [
      "x",
      "relation",
      "node"
    ],
    "texts": {
      "english": "Which entity is related by relation {0} to {1}?"
    },
    "groups": {
      "english": "Generic (1E)"
    }
  },
  {
    "gid": "10",
    "cypher": "MATCH (node)-[relation:{1}]->(x) WHERE node.lemma =~ \"{0}\" RETURN *",
    "input": [
      {
        "id": "n",
        "type": "entity"
      },
      {
        "id": "r",
        "type": "relation"
      }
    ],
    "output": [
      "node",
      "relation",
      "x"
    ],
    "texts": {
      "english": "To which entity is {0} related by relation {1}?"
    },
    "groups": {
      "english": "Generic (1E)"
    }
  },
  {
    "gid": "10",
    "cypher": "MATCH (n1)-[x]->(n2) WHERE n1.lemma =~ \"{0}\" AND n2.lemma =~ \"{1}\" RETURN *",
    "input": [
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "n2",
        "type": "entity"
      }
    ],
    "output": [
      "n1",
      "x",
      "n2"
    ],
    "texts": {
      "english": "How is {0} related to {1}?"
    },
    "groups": {
      "english": "Generic (1E)"
    }
  },
  {
    "gid": "10",
    "cypher": "MATCH (n1:{1})-[x]->(n2:{3}) WHERE n1.lemma =~ \"{0}\" AND n2.lemma =~ \"{2}\" RETURN *",
    "input": [
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "t1",
        "type": "entity_type"
      },
      {
        "id": "n2",
        "type": "entity"
      },
      {
        "id": "t2",
        "type": "entity_type"
      }
    ],
    "output": [
      "n1",
      "x",
      "n2"
    ],
    "texts": {
      "english": "How is {0} of type {1} is related to {2} of type {3}?"
    },
    "groups": {
      "english": "Generic (1E)"
    }
  },
  {
    "gid": "10",
    "cypher": "MATCH (n1:{0})-[r:{1}]->(n2:{2}) RETURN *",
    "input": [
      {
        "id": "t1",
        "type": "entity_type"
      },
      {
        "id": "r",
        "type": "relation"
      },
      {
        "id": "t2",
        "type": "entity_type"
      }
    ],
    "output": [
      "n1",
      "r",
      "n2"
    ],
    "texts": {
      "english": "Show all matches where an entity of type {0} has relation {1} with an entity of type {2}."
    },
    "groups": {
      "english": "Generic (1E)"
    }
  },
  {
    "gid": "11",
    "cypher": "MATCH (n1)<-[r1:{0}]-(x)-[r2:{2}]->(n2) WHERE n1.lemma =~ \"{1}\" AND n2.lemma =~ \"{3}\" RETURN *",
    "input": [
      {
        "id": "r1",
        "type": "relation"
      },
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "r2",
        "type": "relation"
      },
      {
        "id": "n2",
        "type": "entity"
      }
    ],
    "output": [
      "x",
      "r1",
      "n1",
      "x",
      "r2",
      "n2"
    ],
    "texts": {
      "english": "Which entity is related by relation {0} to {1} and by relation {2} to {3}?"
    },
    "groups": {
      "english": "Generic (2E)"
    }
  },
  {
    "gid": "11",
    "cypher": "MATCH (x)-[r1:{0}]->(n1)-[r2:{2}]->(n2) WHERE n1.lemma =~ \"{1}\" AND n2.lemma =~ \"{3}\" RETURN *",
    "input": [
      {
        "id": "r1",
        "type": "relation"
      },
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "r2",
        "type": "relation"
      },
      {
        "id": "n2",
        "type": "entity"
      }
    ],
    "output": [
      "x",
      "r1",
      "n1",
      "r2",
      "n2"
    ],
    "texts": {
      "english": "Which entity is related by relation {0} to entity {1} which in turn is related by relation {2} to entity {3}?"
    },
    "groups": {
      "english": "Generic (2E)"
    }
  },
  {
    "gid": "11",
    "cypher": "MATCH (n1)-[r1:{1}]->(x)<-[r2:{3}]-(n2) WHERE n1.lemma =~ \"{0}\" AND n2.lemma =~ \"{2}\" RETURN *",
    "input": [
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "r1",
        "type": "relation"
      },
      {
        "id": "n2",
        "type": "entity"
      },
      {
        "id": "r2",
        "type": "relation"
      }
    ],
    "output": [
      "n1",
      "r1",
      "x",
      "n2",
      "r2",
      "x"
    ],
    "texts": {
      "english": "To which entity is {0} related by relation {1} and {2} related by relation {3}?"
    },
    "groups": {
      "english": "Generic (2E)"
    }
  },
  {
    "gid": "11",
    "cypher": "MATCH (n1)-[r1:{1}]->(x)-[r2:{2}]->(n2) WHERE n1.lemma =~ \"{0}\" AND n2.lemma =~ \"{3}\" RETURN *",
    "input": [
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "r1",
        "type": "relation"
      },
      {
        "id": "r2",
        "type": "relation"
      },
      {
        "id": "n2",
        "type": "entity"
      }
    ],
    "output": [
      "n1",
      "r1",
      "x",
      "r2",
      "n2"
    ],
    "texts": {
      "english": "{0} is related by relation {1} to which entity which in turn is related by relation {2} to entity {3}?"
    },
    "groups": {
      "english": "Generic (2E)"
    }
  },
  {
    "gid": "11",
    "cypher": "MATCH (n1)-[r1:{1}]->(n2)-[r2:{3}]->(x) WHERE n1.lemma =~ \"{0}\" AND n2.lemma =~ \"{2}\" RETURN *",
    "input": [
      {
        "id": "n1",
        "type": "entity"
      },
      {
        "id": "r1",
        "type": "relation"
      },
      {
        "id": "n2",
        "type": "entity"
      },
      {
        "id": "r2",
        "type": "relation"
      }
    ],
    "output": [
      "n1",
      "r1",
      "n2",
      "r2",
      "x"
    ],
    "texts": {
      "english": "{0} is related by relation {1} to {2} which in turn is related by relation {3} to which entity?"
    },
    "groups": {
      "english": "Generic (2E)"
    }
  }
]